{
  
  "teams": [
    {
      "icon": "team-icons/empire.png",
      "name": "Empire Wanderers",
      "history": "The Empire Wanderers football club, founded in a galaxy far, far away, has a rich tradition of dominance on the field. With a strong emphasis on discipline and tactical prowess, the Empire Wanderers have conquered numerous tournaments across the galaxy. Led by their formidable lineup of players, including Grand Admiral Thrawn, Grand Moff Tarkin, and Darth Sidious, the Empire Wanderers continue to strike fear into the hearts of their opponents.",
      "matches_played": 18,
      "wins": 10,
      "draws": 4,
      "losses": 4,
      "goals_for": 29,
      "goals_against": 18,
      "points": 34,
      "players": [
        {
          "name": "Grand Admiral Thrawn",
          "position": "Goalkeeper",
          "bio": "Grand Admiral Thrawn, a highly skilled goalkeeper celebrated for his strategic prowess and tactical brilliance on the field. Renowned for his exceptional anticipation and calm demeanor under pressure, Thrawn has become a legend in the sport. Off the field, his dedication to perfection and relentless pursuit of excellence make him a role model for aspiring players everywhere.",
          "clean_sheets": 5,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Grand Moff Tarkin",
          "position": "Defender",
          "bio": "Grand Moff Tarkin is a stalwart defender celebrated for his unwavering resolve and commanding presence on the field. With a reputation for unyielding defense and tactical brilliance, he strikes fear into adversaries and instills confidence in teammates. Off the field, Tarkin is revered for his leadership and commitment to sportsmanship.",
          "goals": 3,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Moff Gideon",
          "position": "Defender",
          "bio": "Moff Gideon, a versatile defender renowned for his tactical brilliance and relentless determination on the field. With exceptional leadership and an imposing physical presence, he marshals the defensive line and strikes fear into adversaries. Off the field, Gideon is dedicated to excellence and upholds the principles of honor and sportsmanship.",
          "goals": 2,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Darth Sidious",
          "position": "Midfielder",
          "bio": "Darth Sidious, the enigmatic midfielder, commands the pitch with a dark mystique that strikes fear into opponents. With unparalleled agility and cunning, he orchestrates plays with deceptive ease, aided by his mastery of the Force. Beyond his formidable skills, Sidious remains shrouded in secrecy, his true motives obscured behind a facade of darkness. His presence commands respect and instills fear in all who oppose him.",
          "goals": 7,
          "assists": 3,
          "yellow_cards": 7,
          "red_cards": 1
        },
        {
          "name": "Director Krennic",
          "position": "Midfielder",
          "bio": "Director Orson Krennic, a formidable midfielder, commands with relentless ambition and unwavering determination. His precision and strategic prowess make him a force on the field, driving his team to success. Krennic's leadership inspires fear and respect, solidifying his legacy as a true midfield maestro.",
          "goals": 4,
          "assists": 6,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Dave the Stormtrooper",
          "position": "Forward",
          "bio": "Dave the Stormtrooper, a dynamic forward, brings determination and humor to the field. Despite challenges, his unwavering spirit and infectious enthusiasm shine. Dave embodies the resilience of the underdog, constantly improving and making his mark on the game. Off the field, his cheerful demeanor and lighthearted personality make him beloved by fans and teammates. Though his aim may falter, Dave's passion and camaraderie make him an invaluable asset to any team.",
          "goals": 4,
          "assists": 14,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Darth Vader",
          "position": "Forward",
          "bio": "Darth Vader, a formidable forward, dominates the pitch with imposing presence and unparalleled skill. His ruthless determination for victory strikes fear into opponents as he uses power and agility to dominate. Off-field, his enigmatic aura and mysterious past add to his legend, earning respect and intrigue. Despite his path shrouded in darkness, Vader's passion for the sport burns bright, propelling him toward glory.",
          "goals": 9,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 5
        }
      ],
      "showPlayersList": false
      
    },
    {
      "icon": "team-icons/rebel.png",
      "name": "Rebels United",
      "history": "Rebels United, formed in defiance of oppressive regimes, represents the resilience and determination of those who fight for freedom. Despite facing overwhelming odds, the Rebels United football club has forged a legacy of courage and solidarity. Led by iconic figures like Yoda, Leia Organa, and Luke Skywalker, Rebels United embodies the spirit of resistance and hope, inspiring fans across the galaxy.",
      "matches_played": 18,
      "wins": 8,
      "draws": 4,
      "losses": 6,
      "goals_for": 24,
      "goals_against": 19,
      "points": 28,
      "players": [
        {
          "name": "Yoda",
          "position": "Goalkeeper",
          "bio": "Yoda, renowned for his wisdom and mastery of the Force, stands as the last of the Jedi Order. Despite his diminutive size, he possesses immense strength and agility, making him a formidable goalkeeper. With his keen insight and exceptional reflexes, Yoda guards the goal with unwavering determination, earning the respect of allies and adversaries alike.",
          "clean_sheets": 6,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Leia Organa",
          "position": "Defender",
          "bio": "Leia Organa, a skilled tactician and leader, serves as a stalwart defender on the field. Known for her courage and resilience, she stands firm against any offensive threat, using her strategic prowess to thwart opposing forwards. With a blend of grace and determination, Leia embodies the spirit of resistance, inspiring her teammates to fight on against the toughest adversaries.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Chewbacca",
          "position": "Defender",
          "bio": "Chewbacca, the towering Wookiee defender, is a formidable force on the field. With his immense strength and unwavering loyalty, Chewbacca stands as a formidable barrier against opposing forwards, using his towering presence to intimidate and disrupt their attacks. Despite his imposing stature, Chewbacca possesses a gentle heart, earning the respect and admiration of teammates and fans alike.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Obi-Wan Kenobi",
          "position": "Midfielder",
          "bio": "Obi-Wan Kenobi, the wise and skillful midfielder, brings balance and finesse to the game. With his keen intellect and mastery of the Force, Obi-Wan orchestrates the flow of play with precision, guiding his team to victory with strategic passes and timely interceptions. Known for his unwavering resolve and unwavering dedication to the sport, Obi-Wan inspires his teammates to reach new heights and overcome any challenge they face on the field.",
          "goals": 4,
          "assists": 3,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Han Solo",
          "position": "Midfielder",
          "bio": "Han Solo, the daring and resourceful midfielder, embodies adventure on the field. With quick reflexes and sharp instincts, he navigates opponents effortlessly, delivering precise passes and making bold moves. Renowned for his charisma and swagger, Han thrills fans with his fearless style of play, leading daring counterattacks and executing clutch plays. Always ready to make a mark on the game, Han Solo brings excitement to every match.",
          "goals": 4,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Luke Skywalker",
          "position": "Forward",
          "bio": "Luke Skywalker, the dynamic forward, possesses a rare blend of skill, speed, and determination. With a natural talent for scoring goals, he electrifies the crowd with acrobatic finishes and precision shots. Beyond his athleticism, Luke's unwavering commitment to teamwork inspires those around him. Whether soaring for headers or dribbling with Jedi-like precision, he is a force to be reckoned with on the soccer field.",
          "goals": 10,
          "assists": 9,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Admiral Ackbar",
          "position": "Forward",
          "bio": "Admiral Ackbar, revered for his strategic brilliance and leadership, adds a tactical edge to the forward position. With precision and timing, he navigates the field, orchestrating attacks and exploiting opponents' weaknesses. His ability to anticipate plays makes him formidable in the attacking third, inspiring confidence in teammates and striking fear into adversaries. With Ackbar leading, victory is always within reach.",
          "goals": 5,
          "assists": 7,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/avengers.png",
      "name": "Avengers FC",
      "history": "Assemble! Avengers FC is not just a football club; it's a force of nature. Drawing upon the extraordinary talents of its members, Avengers FC has emerged as a beacon of strength and heroism. With players like Captain America, Black Widow, and Black Panther leading the charge, Avengers FC defends the goal with unwavering resolve, ready to tackle any challenge that comes their way.",
      "matches_played": 18,
      "wins": 5,
      "draws": 5,
      "losses": 8,
      "goals_for": 21,
      "goals_against": 26,
      "points": 20,
      "players": [
        {
          "name": "Captain America",
          "position": "Goalkeeper",
          "bio": "Captain America, known for courage and determination, defends the goal with honor. His athleticism and strategic insight make him a stalwart protector, embodying teamwork and heroism. With him guarding the goal, the team trusts in his unwavering dedication.",
          "clean_sheets": 4,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Hulk",
          "position": "Defender",
          "bio": "The Hulk, known for immense strength and resilience, defends with unmatched power and ferocity. His towering presence on the field strikes fear into opponents, showcasing raw power and indomitable spirit. Despite his intimidating exterior, the Hulk is fiercely loyal to teammates and unwavering in his commitment to protect the goal. With him as defender, the team is fortified by the strongest guardian imaginable.",
          "goals": 2,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Thor",
          "position": "Defender",
          "bio": "Thor, the God of Thunder, defends with his mighty presence, wielding Mjolnir with unparalleled skill. Combining godly powers with tactical prowess, he ensures no opponent breaches his defensive line. With lightning crackling, Thor inspires greatness in teammates and strikes fear into adversaries. His dedication to justice and honor drives him to defend with unwavering resolve, making him invaluable to any team. With Thor guarding the goal, the team faces challenges with confidence, protected by the power of a god.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 5,
          "red_cards": 0
        },
        {
          "name": "Black Widow",
          "position": "Midfielder",
          "bio": "Black Widow, the master spy and elite tactician, dominates the midfield with agility and strategic brilliance. Trained in combat and espionage, she orchestrates plays with deadly efficiency, creating scoring opportunities and intercepting passes. With her fierce determination, she excels in every aspect of the game, giving the team a decisive advantage.",
          "goals": 2,
          "assists": 8,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Scarlet Witch",
          "position": "Midfielder",
          "bio": "Scarlet Witch, master of chaos magic, dominates the midfield with her otherworldly talents. With the power to manipulate reality, she controls the game effortlessly, guiding the ball past defenders with precision. Unpredictable and mesmerizing, she leads her team to victory with unwavering determination.",
          "goals": 4,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Black Panther",
          "position": "Forward",
          "bio": "Black Panther, the sovereign of Wakanda, dominates the forward position with unmatched agility and combat skills. With his vibranium suit, he maneuvers swiftly, scoring goals with precision. A symbol of leadership and integrity, he inspires unity and excellence in his team, ready to lead them to victory.",
          "goals": 8,
          "assists": 4,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Vision",
          "position": "Forward",
          "bio": "Vision, the enigmatic android powered by the Mind Stone, brings unparalleled strength and agility to the forward position. Crafted from vibranium, his synthetic body grants remarkable speed and precision on the field. With the ability to phase through solid objects, Vision navigates defenses with ease, creating scoring opportunities for his team. His unwavering commitment to justice inspires teammates, driving them toward victory.",
          "goals": 5,
          "assists": 6,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/eyeofsauron.png",
      "name": "Mordor City",
      "history": "From the depths of darkness rises Mordor City, a football club shrouded in shadow and mystery. Fueled by ambition and a thirst for power, Mordor City dominates the field with relentless determination. Led by the imposing presence of The Dark Lord Sauron and the cunning strategy of Saruman, Mordor City strikes fear into the hearts of its adversaries, forging a legacy of conquest and domination.",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 28,
      "goals_against": 22,
      "points": 27,
      "players": [
        {
          "name": "Mouth of Sauron",
          "position": "Goalkeeper",
          "bio": "Mouth of Sauron guards the goal with an ominous presence, instilling fear in opposing strikers with his dark armor and sinister demeanor. His keen reflexes and strategic mind make him a formidable last line of defense, deflecting shots with eerie precision. Loyalty to Sauron's forces drives him to protect the net at any cost. As the gatekeeper of darkness, he stands resolute, ready to repel any threat to his team's goal.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Witch-King of Angmar",
          "position": "Defender",
          "bio": "The Witch-King of Angmar, a stalwart defender, commands the battlefield with dread and power. Clad in dark armor and wielding a formidable weapon, he strikes fear into adversaries. With unmatched strength and resilience, he thwarts enemy advances with precision. Bound by his oath to defend his realm, he inspires teammates with unwavering dedication. His presence strikes terror into the opposition, making him a formidable force.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lurtz",
          "position": "Defender",
          "bio": "Lurtz, a formidable defender, dominates the field with imposing stature and ruthless efficiency. Born from Isengard's darkness, he strikes fear into foes with unmatched combat skills. As a bulwark against offenses, Lurtz uses strength and agility to protect his team's goal. Loyalty to Saruman drives him to excel, inspiring fear and respect. He embodies the relentless spirit of orcs, willing to sacrifice all for victory.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Balrog of Moria",
          "position": "Midfielder",
          "bio": "The Balrog of Moria, a fierce midfielder, dominates with immense power and fiery presence. Emerging from Khazad-dûm, it engulfs opponents in destruction, inspiring fear and awe. With relentless pursuit of victory, it embodies the forces of darkness, ready to crush any opposition.",
          "goals": 3,
          "assists": 3,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Saruman",
          "position": "Midfielder",
          "bio": "Saruman, the cunning midfielder, commands with strategic brilliance and mystical prowess. Orchestrating plays with precision, he manipulates the game to his advantage. Gifted in arcane arts and tactics, he confuses opponents, leaving them vulnerable to his team's attacks. Master of persuasion, Saruman inspires loyalty and cohesion, leading his team to triumph with unwavering determination.",
          "goals": 4,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "The Dark Lord Sauron",
          "position": "Forward",
          "bio": "The Dark Lord Sauron, a menacing force as a relentless forward, dominates the pitch with overwhelming power and ambition. Like the shadow of Barad-dûr, he instills fear with every stride and pierces defenses with his fiery gaze. With unyielding determination, he drives his team forward, unleashing thunderous shots that shake the field. As the embodiment of darkness, he leads with an iron will, commanding conquest. With each goal, Sauron heralds the triumph of darkness, forever altering the game's course.",
          "goals": 10,
          "assists": 9,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Azog the Defiler",
          "position": "Forward",
          "bio": "Azog the Defiler dominates as a forward with sheer strength and relentless drive, striking fear with each thunderous shot on goal. His towering presence and ruthless determination make him formidable, leaving opponents scrambling to contain his attacks. With every goal, Azog solidifies his reputation, driving his team forward with unmatched ferocity.",
          "goals": 9,
          "assists": 12,
          "yellow_cards": 1,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/ring.png",
      "name": "Fellowship of the Ring",
      "history": "One ring to rule them all, one team to conquer them all. The Fellowship of the Ring football club embarks on a quest for glory, united by friendship and a common purpose. With players like Gandalf, Aragorn, and Legolas leading the charge, the Fellowship of the Ring faces adversity with courage and resilience, forging a fellowship that transcends the boundaries of the pitch.",
      "matches_played": 18,
      "wins": 8,
      "draws": 2,
      "losses": 8,
      "goals_for": 27,
      "goals_against": 25,
      "points": 26,
      "players": [
        {
          "name": "Elrond",
          "position": "Goalkeeper",
          "bio": "Elrond, the wise and vigilant guardian of Rivendell, stands tall as the last line of defense in the goalkeeping position. With keen foresight and unwavering focus, he anticipates the movements of opposing strikers, ready to deflect any shot that comes his way. His calm demeanor and strategic prowess inspire confidence in his teammates, instilling a sense of security in the heart of the defense. As the protector of his realm and his team, Elrond brings honor and resilience to the soccer pitch, embodying the spirit of a true leader and guardian.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Boromir",
          "position": "Defender",
          "bio": "Boromir, the valiant defender of Gondor, brings strength and determination to the backline as he stands firm against attackers. With unwavering resolve and tactical insight, he shields teammates, embodying courage and loyalty on the pitch. Inspiring unity and resilience, Boromir instills hope in adversity. With unwavering commitment to defend at all costs, he proves formidable in defense, ready to confront any challenge.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gimli",
          "position": "Defender",
          "bio": "Gimli, the stout-hearted defender from Erebor, stands tall on the soccer pitch with unmatched resilience and determination. With axe in hand, he shields teammates with loyalty and valor, embodying dwarven spirit. As protector of goal and comrades, Gimli inspires courage and camaraderie, rallying his team against adversaries. With steadfast commitment to defend with honor, he proves an immovable force, ready to face any challenge.",
          "goals": 0,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gandalf",
          "position": "Midfielder",
          "bio": "Gandalf, the revered midfielder, commands with unparalleled wisdom and mastery. His presence inspires teammates, instilling courage and resilience. With astute strategy and magical prowess, Gandalf navigates confidently, turning the game in his team's favor. As mentor and leader, he fosters unity and camaraderie, leading with unwavering resolve toward victory.",
          "goals": 2,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Frodo",
          "position": "Midfielder",
          "bio": "Frodo, the agile midfielder, maneuvers with determination and grace, showcasing courage and resilience. Despite his stature, he proves strength lies in heart and spirit. Off the field, his humility and kindness foster camaraderie among teammates. With victory in sight, Frodo embarks on the journey with unwavering determination, ready to conquer any challenge.",
          "goals": 3,
          "assists": 12,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Aragorn",
          "position": "Forward",
          "bio": "Aragorn, the valiant forward, leads with unparalleled skill and determination, embodying the spirit of a true warrior on the field. Blessed with strength, agility, and strategic insight, he navigates through defenders effortlessly, leaving awe in his wake. Off the field, his leadership and courage inspire teammates, instilling belief in victory. As the final whistle blows, Aragorn stands ready to lead his team to glory, both on the pitch and in history.",
          "goals": 5,
          "assists": 7,
          "yellow_cards": 2,
          "red_cards": 1
        },
        {
          "name": "Legolas",
          "position": "Forward",
          "bio": "Legolas, the swift forward, brings elven grace to the pitch, striking fear into defenders with unparalleled accuracy and nimble footwork. Off the field, he inspires teammates with dedication and humility. Ready to lead his team to victory, Legolas unleashes unrivaled talent with every goal.",
          "goals": 16,
          "assists": 0,
          "yellow_cards": 3,
          "red_cards": 1
        }
      ]
    },
    {
      "icon": "team-icons/stark.png",
      "name": "Stark FC",
      "history": "Winter is coming, but Stark FC remains undaunted. Hailing from the icy realms of the North, Stark FC embodies the resilience and fortitude of its namesake house. Led by stalwart leaders like Ned Stark and Arya Stark, Stark FC defends its territory with honor and determination, ready to face any challenge that comes its way.",
      "matches_played": 18,
      "wins": 6,
      "draws": 4,
      "losses": 8,
      "goals_for": 22,
      "goals_against": 23,
      "points": 22,
      "players": [
        {
          "name": "Ned Stark",
          "position": "Goalkeeper",
          "bio": "Ned Stark, the stalwart goalkeeper, brings honor and resilience to the field. His leadership and commitment inspire unity and determination. With bravery and selflessness, he defends the goal, earning respect from teammates and rivals alike. With every save, he leads his team to victory with unwavering resolve.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 1,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Rob Stark",
          "position": "Defender",
          "bio": "Robb Stark, the stalwart defender, commands the field with honor and courage. His unwavering loyalty and skillful tackles inspire trust among teammates, fostering unity and determination. With Robb at the helm, his team stands resilient, ready to face any challenge with strength and resolve.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Benjen Stark",
          "position": "Defender",
          "bio": "Benjen Stark, the vigilant defender, safeguards his team with unwavering dedication. His sharp instincts and swift interceptions thwart opponents' advances, ensuring the safety of his goal. As a stalwart protector, Benjen instills confidence in his fellow players, fortifying the team's defense with his resilience and commitment.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Bran Stark",
          "position": "Midfielder",
          "bio": "Bran Stark, the enigmatic midfielder, orchestrates plays with an otherworldly intuition. His strategic vision and precise passes unlock opportunities, shaping the team's rhythm and direction. Despite his enigmatic demeanor, Bran's presence on the field exudes a quiet confidence, inspiring his teammates to trust in his leadership and foresight.",
          "goals": 2,
          "assists": 4,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Rickon Stark",
          "position": "Midfielder",
          "bio": "Rickon Stark, the agile midfielder, brings youthful energy and determination to the game. With his swift footwork and fearless attitude, Rickon navigates through opponents, creating openings and disrupting defenses. Despite his tender age, Rickon's passion for the sport fuels his relentless pursuit of victory, making him a formidable force on the field.",
          "goals": 3,
          "assists": 4,
          "yellow_cards": 5,
          "red_cards": 0
        },
        {
          "name": "Catelyn Stark",
          "position": "Forward",
          "bio": "Catelyn Stark, the dynamic forward, possesses strategy and finesse on the soccer pitch. With sharp instincts, she orchestrates plays and capitalizes on scoring opportunities. Her leadership and determination inspire teammates to excel. Relentless in pursuit ofgoals, Catelyn's dedication makes her a formidable asset in any match.",
          "goals": 8,
          "assists": 4,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Arya Stark",
          "position": "Forward",
          "bio": "Arya Stark, the agile forward, brings unmatched speed and agility to the field. With swift footwork and fierce determination, she leaves defenders bewildered. Her relentless competitiveness inspires teammates to greatness. With lightning-fast reflexes, Arya is a formidable force, capable of turning the tide of any match.",
          "goals": 8,
          "assists": 3,
          "yellow_cards": 6,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/lannister.png",
      "name": "Lannister FC",
      "history": "A Lannister always pays his debts, and Lannister FC always delivers on the pitch. Known for their cunning tactics and ruthless ambition, Lannister FC strikes fear into the hearts of their opponents. Led by figures like Tyrion Lannister and Cersei Lannister, Lannister FC plays the game with calculated precision, ensuring victory at any cost.",
      "matches_played": 18,
      "wins": 6,
      "draws": 2,
      "losses": 10,
      "goals_for": 18,
      "goals_against": 27,
      "points": 20,
      "players": [
        {
          "name": "Tyrion Lannister",
          "position": "Goalkeeper",
          "bio": "Tyrion Lannister, the cunning goalkeeper, defends with intellect and quick thinking, using precision and finesse. Despite his stature, he displays remarkable agility and reflexes, making acrobatic saves. Off the field, Tyrion's wit and charm rally teammates and boost morale. His unorthodox methods keep strikers guessing, making him formidable. With sharp mind and determination, Tyrion protects his team's goal at all costs.",
          "clean_sheets": 5,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Jamie Lannister",
          "position": "Defender",
          "bio": "Jaime Lannister, skilled defender, brings finesse and determination to the backline. Renowned for tactical prowess, he's reliable and inspiring, fostering team unity. With unwavering commitment, Jaime leads his team to victory by thwarting opposing attacks.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 6,
          "red_cards": 2
        },
        {
          "name": "Tywin Lannister",
          "position": "Defender",
          "bio": "Tywin Lannister, commanding presence in defense, brings intelligence and authority to the backline. Renowned for strategic acumen, he ensures readiness for any challenge. His dedication inspires respect. Off the field, he mentors, instilling values of discipline and teamwork. With keen mind and determination, Tywin leads his team to success.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Cersei Lannister",
          "position": "Midfielder",
          "bio": "Cersei Lannister, midfield maestro, combines grace and cunning on the pitch. With sharp intellect, she orchestrates play, dictating tempo and direction. Her ability to anticipate opponents makes her formidable, turning defense into swift counterattacks. Beyond skill with the ball, Cersei's determination and ambition drive her to seize victory. Off the field, her presence and insight inspire greatness. With strategic vision and indomitable spirit, Cersei leads her team to glory.",
          "goals": 3, 
          "assists": 3,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Joffrey Baratheon",
          "position": "Midfielder",
          "bio": "Joffrey Baratheon, midfielder with regal air, brings arrogance and flair to the pitch. Blessed with talent and royal upbringing, his confidence matches skill. With quick feet and sharp instincts, he navigates midfield effortlessly. However, showboating and temper can overshadow talent, making him divisive. Despite flaws, hunger for success and desire to prove himself drive him to greatness. Eyes set on glory, Joffrey aims to claim his place among soccer's elite.",
          "goals": 2,
          "assists": 9,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Tommen Baratheon",
          "position": "Forward",
          "bio": "Tommen Baratheon, forward with gentle demeanor, brings innocence and purity to the field. Despite youth, possesses natural talent for scoring, fueled by dedication and love for the game. With quick reflexes and sharp instincts, navigates opposition's defense effortlessly. Off the field, humility and kindness earn respect from fans and teammates. Eyes light up with excitement as he steps onto the field, ready to showcase skills and make his mark while staying true to values.",
          "goals": 6,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lancel Lannister",
          "position": "Forward",
          "bio": "Lancel Lannister, forward renowned for agility and determination, brings fierce competitiveness to the pitch. Despite slender frame, possesses remarkable speed and precision, making him formidable. With keen eye for goal, often catalyst for team's attacking plays. Off the field, dedication to training and commitment to team earn admiration. As he takes to the field, focus is unwavering, driven by desire to succeed and lead team to victory.",
          "goals": 6,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 1
        }
      ]
    },
    {
      "icon": "team-icons/gryffindor.png",
      "name": "Gryffindor Rovers",
      "history": "For Gryffindor Rovers, the football pitch is their Hogwarts, and victory is their magic. Representing the courage and valor of Gryffindor House, Gryffindor Rovers plays with unwavering determination and spirit. With players like Harry Potter, Hermione Granger, and Ron Weasley leading the charge, Gryffindor Rovers embodies the noble ideals of bravery and camaraderie.",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 19,
      "goals_against": 20,
      "points": 27,
      "players": [
        {
          "name": "Minerva McGonagall",
          "position": "Goalkeeper",
          "bio": "Minerva McGonagall, stoic goalkeeper with exceptional reflexes, stands as a formidable guardian of the goalposts. Commanding presence inspires teammates. Off the field, respected leader known for commitment to excellence and fairness. Ready to defend her team's goal with unmatched skill and dedication.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Ginny Weasley",
          "position": "Defender",
          "bio": "Ginny Weasley, fearless defender known for tenacity and agility, stands stalwart in guarding the team's defensive line. With quick reflexes and strategic mind, anticipates opposing attackers' moves, thwarting goal-scoring opportunities. Her determination and leadership inspire teammates, rallying them to give their all. Admired for unwavering loyalty and courage on and off the field. With unwavering resolve, Ginny is a formidable opponent, ready to protect her team's goal with determination.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Ron Weasley",
          "position": "Defender",
          "bio": "Ron Weasley, dependable defender, brings resilience and determination to the team's defensive lineup. With keen awareness and tactical prowess, excels at thwarting opposing attackers. His unwavering commitment and loyalty make him reliable on the field. Beyond the pitch, his friendly demeanor and support for teammates make him beloved. As he takes position, Ron's defensive skill and steadfast resolve make him invaluable, ready to protect the team's goal with determination.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "Fred Weasley",
          "position": "Midfielder",
          "bio": "Fred Weasley, dynamic midfielder, injects creativity and flair into the team's midfield with quick wit and clever footwork. Known for unpredictable playing style and knack for unexpected maneuvers, keeps opponents guessing and teammates inspired. Infectious energy and playful spirit foster positive atmosphere on and off the pitch. Ability to turn tide of match with well-timed pass or daring shot on goal adds crucial dimension to team's attacking prowess. As he orchestrates plays, Fred drives the team forward towards victory.",
          "goals": 2,
          "assists": 3,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "George Weasley",
          "position": "Midfielder",
          "bio": "George Weasley, versatile midfielder, dictates play with astute vision and precise passing. His creative playmaking and sharp instincts make him a linchpin of the team's offense, inspiring success. Beyond the field, his determination and resilience drive his teammates to excel. George consistently demonstrates commitment to the team's objectives, earning admiration from fans and teammates.",
          "goals": 3,
          "assists": 3,
          "yellow_cards": 6,
          "red_cards": 0
        },
        {
          "name": "Harry Potter",
          "position": "Forward",
          "bio": "Harry Potter, lightning-fast forward, electrifies the pitch with remarkable speed and agility. Focal point of team's attack, he outmaneuvers defenders and creates scoring opportunities with exceptional athleticism and quick footwork. Natural instinct for goal-scoring and composure under pressure make him a constant threat. Off the field, his leadership qualities and determination foster camaraderie and unity within the squad. Harry Potter, a true footballing wizard, leaves a lasting legacy on the game with boundless talent and indomitable spirit.",
          "goals": 5,
          "assists": 4,
          "yellow_cards": 8,
          "red_cards": 2
        },
        {
          "name": "Hermione Granger",
          "position": "Forward",
          "bio": "Hermione Granger, forward with exceptional intellect, brings skill and strategy to the pitch. Renowned for tactical prowess, she exploits opponent weaknesses with precise passing and deft ball control, inspiring teammates to excel. With intelligence, skill, and passion, Hermione proves greatness knows no bounds on the football pitch.",
          "goals": 8,
          "assists": 8,
          "yellow_cards": 3,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/slytherin.png",
      "name": "Slytherin Albion",
      "history": "Ambition knows no bounds for Slytherin Albion, a football club driven by cunning and ambition. Drawing upon the dark arts of the pitch, Slytherin Albion maneuvers its way to victory with ruthless efficiency. Led by figures like Severus Snape and Lord Voldemort, Slytherin Albion plays the game with calculated precision, ensuring that victory always belongs to the cunning.",
      "matches_played": 18,
      "wins": 6,
      "draws": 4,
      "losses": 8,
      "goals_for": 15,
      "goals_against": 28,
      "points": 22,
      "players": [
        {
          "name": "Vincent Crabbe",
          "position": "Goalkeeper",
          "bio": "Vincent Crabbe, imposing goalkeeper, strikes fear with his stature and lightning reflexes, a reliable last line of defense. Known for loyalty and commitment, his shot-stopping prowess makes him invaluable for any team seeking victory on the football pitch.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Severus Snape",
          "position": "Defender",
          "bio": "Severus Snape, enigmatic defender, anticipates opposition moves with precision, neutralizing threats with ease. Known for loyalty and commitment, he inspires teammates to strive for greatness, anchoring the defense with unwavering resolve.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lucius Malfoy",
          "position": "Defender",
          "bio": "Lucius Malfoy, the sleek defender, blends elegance with ruthlessness on the field. With aristocratic poise, he controls the backline, ensuring security and organization. His strategic mind and impeccable footwork outmaneuver attackers with finesse. Despite controversy, his commitment to victory remains unwavering. With Malfoy guarding the defense, his team faces challenges confidently.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Bellatrix Lestrange",
          "position": "Midfielder",
          "bio": "Bellatrix Lestrange, a fierce midfielder, embodies chaos and unpredictability on the pitch. Her cunning and aggression disrupt opponents' strategies, creating opportunities for her team. With her unyielding determination and dark prowess, she dominates the midfield, instilling fear in her adversaries. Despite her menacing demeanor, her loyalty to her team is unwavering. With Lestrange on the field, victory is within reach, no matter the odds.",
          "goals": 2,
          "assists": 1,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lord Voldemort",
          "position": "Midfielder",
          "bio": "Lord Voldemort, a formidable midfielder, commands the field with his dark powers and strategic brilliance. His unmatched agility and cunning make him a relentless force to be reckoned with. With a singular focus on victory, Voldemort spares no effort in leading his team to triumph. Despite his sinister reputation, his dedication to the sport is undeniable, driving him to excel on the pitch. With Voldemort as their midfield maestro, his team strikes fear into the hearts of opponents, ensuring dominance with every match.",
          "goals": 3,
          "assists": 6,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Draco Malfoy",
          "position": "Forward",
          "bio": "Draco Malfoy, a dynamic forward, brings a blend of skill and determination to the pitch. With swift footwork and precise strikes, he poses a constant threat to opposing defenses. Draco's strategic mindset and competitive spirit drive him to push beyond his limits in pursuit of victory. Despite his reputation, Draco's commitment to his team and the sport shines through in every match. As he takes to the field, Draco Malfoy is poised to leave his mark as a formidable force in the world of soccer.",
          "goals": 4,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gregory Goyle",
          "position": "Forward",
          "bio": "Gregory Goyle, a powerful forward, showcases his strength and tenacity on the soccer field. With a robust physique and imposing presence, he excels in physical battles against defenders. Goyle's determination and unwavering focus make him a reliable asset in both scoring goals and creating opportunities for his team. Despite his intimidating demeanor, Goyle's passion for the game drives him to overcome challenges and contribute to his team's success. As he charges forward with determination, Gregory Goyle proves to be a formidable force in the world of soccer.",
          "goals": 5,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/hydra.png",
      "name": "MCU Villains",
      "history": "From the shadows of the Marvel universe emerges MCU Villains, a football club fueled by chaos and villainy. With a roster of nefarious characters like Loki, Thanos, and Hela, MCU Villains wreak havoc on the pitch with their formidable skills and insidious strategies. Unleashing their dark powers, MCU Villains strike fear into the hearts of their adversaries, leaving a trail of destruction in their wake.",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 20,
      "goals_against": 15,
      "points": 27,
      "players": [
        {
          "name": "Loki",
          "position": "Goalkeeper",
          "bio": "Loki, the cunning goalkeeper, keeps opponents guessing with his deceptive tactics and quick reflexes. His mastery of illusions unnerves opposing teams, making him a formidable obstacle in front of the goal. Despite his mischievous nature, Loki's loyalty to his team drives him to protect the net with unwavering determination, proving to be an invaluable asset to his team's defense.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Killmonger",
          "position": "Defender",
          "bio": "Killmonger, the tenacious defender, embodies resilience and strength on the soccer field. With exceptional athleticism and combat skills, he dominates the defensive line, thwarting opponents' advances with unwavering resolve. His unwavering commitment and fierce determination inspire his teammates, making him an indispensable pillar of his team's defense.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gorr the God Butcher",
          "position": "Defender",
          "bio": "Gorr the God Butcher, a formidable defender, brings unparalleled strength and ferocity to the soccer field. With relentless determination, he dominates the defensive line, thwarting opponents' attacks with unmatched skill. Born from tragedy, Gorr embodies resilience and tenacity, inspiring fear in adversaries and courage in teammates. With Gorr on the field, his team can count on his unwavering commitment to defend their goal with unmatched determination.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Thanos",
          "position": "Midfielder",
          "bio": "Thanos, the powerful midfielder, dominates the pitch with strength and strategy. Driven by a vision of balance, he inspires fear in opponents and admiration in teammates. With unmatched skill and determination, Thanos leads his team to victory.",
          "goals": 3,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Ultron",
          "position": "Midfielder",
          "bio": "ltron, the midfield marvel, blends advanced technology with agility on the pitch. Commanding with ruthless efficiency, he maneuvers effortlessly and orchestrates plays with precision. Driven by perfection, his determination leads his team to victory.",
          "goals": 2,
          "assists": 8,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "Hela",
          "position": "Forward",
          "bio": "Hela, the formidable forward, dominates the pitch with her unmatched strength and lethal prowess. As the Goddess of Death, she strikes fear into defenders, overpowering them with ease. With her speed, agility, and precision, Hela maneuvers past opponents with grace, leaving a trail of destruction. Her relentless determination leads her team to victory with unmatched ferocity.",
          "goals": 6,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "The Winter Soldier",
          "position": "Forward",
          "bio": "The Winter Soldier, a powerful forward, blends precision and strength on the field. With a mysterious past, he brings intrigue to the game. Mastering combat and strategy, he maneuvers through defenses with calculated precision, instilling fear in opponents. Fueled by duty and purpose, he pushes boundaries for his team's success. With each goal, he cements his legacy, inspiring awe on the soccer pitch.",
          "goals": 8,
          "assists": 5,
          "yellow_cards": 6,
          "red_cards": 0
        }
      ]
    }
  ]
}