{
  
  "teams": [
    {
      "icon": "team-icons/empire.png",
      "name": "Empire Wanderers",
      "matches_played": 18,
      "wins": 10,
      "draws": 4,
      "losses": 4,
      "goals_for": 29,
      "goals_against": 18,
      "points": 34,
      "players": [
        {
          "name": "Grand Admiral Thrawn",
          "position": "Goalkeeper",
          "bio": "Grand Admiral Thrawn is a highly skilled goalkeeper renowned for his exceptional strategic thinking and tactical prowess on the field. With a keen eye for detail and an unmatched ability to anticipate his opponents' moves, Thrawn has become a legend in the sport. His disciplined approach, coupled with his calm demeanor under pressure, makes him a formidable presence in the goalmouth. Off the field, Thrawn is known for his dedication to perfection and his relentless pursuit of excellence, making him a role model for aspiring players everywhere.",
          "clean_sheets": 5,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Grand Moff Tarkin",
          "position": "Defender",
          "bio": "Grand Moff Tarkin is a stalwart defender known for his unwavering resolve and commanding presence on the field. With a reputation for unyielding defense and tactical brilliance, Tarkin is a formidable force in thwarting opposing attacks. His strategic mind and ironclad discipline instill confidence in his teammates and strike fear into the hearts of his adversaries. Off the field, Tarkin is respected for his leadership qualities and dedication to upholding the highest standards of sportsmanship and integrity.",
          "goals": 3,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Moff Gideon",
          "position": "Defender",
          "bio": "Moff Gideon, a versatile defender with a commanding presence, is renowned for his tactical prowess and relentless determination on the field. With a keen eye for reading the game and an imposing physical presence, Gideon is a formidable force in thwarting opponent attacks and marshaling the defensive line. His strategic acumen, coupled with exceptional leadership skills, inspires confidence in his teammates and strikes fear into the hearts of adversaries. Off the field, Gideon is known for his unwavering commitment to excellence and his dedication to the principles of honor and sportsmanship.",
          "goals": 2,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Darth Sidious",
          "position": "Midfielder",
          "bio": "Darth Sidious, the enigmatic midfielder, possesses an aura of dark mystique that instills fear and uncertainty in his opponents. With unparalleled agility and cunning, Sidious maneuvers through the midfield with calculated precision, orchestrating plays with deceptive ease. His mastery of the Force grants him an edge on the pitch, allowing him to anticipate movements and outmaneuver adversaries effortlessly. Beyond his formidable skills on the field, Sidious is a figure shrouded in secrecy, his true motives and ambitions obscured behind a facade of darkness. His presence on the pitch commands respect and strikes fear into the hearts of all who dare to oppose him.",
          "goals": 7,
          "assists": 3,
          "yellow_cards": 7,
          "red_cards": 1
        },
        {
          "name": "Director Krennic",
          "position": "Midfielder",
          "bio": "Director Orson Krennic, a formidable midfielder, is known for his relentless pursuit of excellence and unyielding ambition on the pitch. With a commanding presence and sharp tactical mind, Krennic orchestrates plays with precision and finesse, leading his team with unwavering determination. His strategic prowess and ability to adapt to any situation make him a formidable force on the field. Behind his composed exterior lies a fierce desire for success and recognition, driving him to push himself and his teammates to their limits. Krennic's leadership and dedication inspire both fear and respect among his peers, cementing his legacy as a true midfield maestro.",
          "goals": 4,
          "assists": 6,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Dave the Stormtrooper",
          "position": "Forward",
          "bio": "Dave the Stormtrooper, a dynamic forward, brings a unique blend of determination and humor to the field. Despite the challenges of his position, Dave's unwavering spirit and infectious enthusiasm never falter. With each match, he strives to improve his skills and make his mark on the game, embodying the resilience and perseverance of the underdog. Off the field, Dave's cheerful demeanor and lighthearted personality make him a beloved figure among fans and teammates alike. Though his aim may sometimes miss the mark, Dave's passion for the game and camaraderie with his fellow players make him an invaluable asset to any team.",
          "goals": 4,
          "assists": 14,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Darth Vader",
          "position": "Forward",
          "bio": "Darth Vader, a formidable forward, commands the pitch with an imposing presence and unparalleled skill. His mastery of the dark arts of soccer is matched only by his ruthless determination to achieve victory. With each stride, Vader strikes fear into the hearts of his opponents, using his power and agility to dominate the game. Off the field, his enigmatic aura and mysterious past only add to his legend, making him a figure of intrigue and respect among fans and teammates alike. Though his path may be shrouded in darkness, Darth Vader's passion for the sport burns bright, driving him ever forward in pursuit of glory.",
          "goals": 9,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 5
        }
      ],
      "showPlayersList": false
      
    },
    {
      "icon": "team-icons/rebel.png",
      "name": "Rebels United",
      "matches_played": 18,
      "wins": 8,
      "draws": 4,
      "losses": 6,
      "goals_for": 24,
      "goals_against": 19,
      "points": 28,
      "players": [
        {
          "name": "Yoda",
          "position": "Goalkeeper",
          "bio": "Yoda, renowned for his wisdom and mastery of the Force, stands as the last of the Jedi Order. Despite his diminutive size, he possesses immense strength and agility, making him a formidable goalkeeper. With his keen insight and exceptional reflexes, Yoda guards the goal with unwavering determination, earning the respect of allies and adversaries alike.",
          "clean_sheets": 6,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Leia Organa",
          "position": "Defender",
          "bio": "Leia Organa, a skilled tactician and leader, serves as a stalwart defender on the field. Known for her courage and resilience, she stands firm against any offensive threat, using her strategic prowess to thwart opposing forwards. With a blend of grace and determination, Leia embodies the spirit of resistance, inspiring her teammates to fight on against the toughest adversaries.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Chewbacca",
          "position": "Defender",
          "bio": "Chewbacca, the towering Wookiee defender, is a formidable force on the field. With his immense strength and unwavering loyalty, Chewbacca stands as a formidable barrier against opposing forwards, using his towering presence to intimidate and disrupt their attacks. Despite his imposing stature, Chewbacca possesses a gentle heart, earning the respect and admiration of teammates and fans alike.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Obi-Wan Kenobi",
          "position": "Midfielder",
          "bio": "Obi-Wan Kenobi, the wise and skillful midfielder, brings balance and finesse to the game. With his keen intellect and mastery of the Force, Obi-Wan orchestrates the flow of play with precision, guiding his team to victory with strategic passes and timely interceptions. Known for his unwavering resolve and unwavering dedication to the sport, Obi-Wan inspires his teammates to reach new heights and overcome any challenge they face on the field.",
          "goals": 4,
          "assists": 3,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Han Solo",
          "position": "Midfielder",
          "bio": "Han Solo, the daring and resourceful midfielder, epitomizes the spirit of adventure on the field. With his quick reflexes and sharp instincts, Han navigates through opponents with ease, making bold moves and delivering precise passes. Renowned for his charisma and swagger, Han brings a sense of excitement to every match, thrilling fans with his fearless style of play. Whether leading his team on daring counterattacks or executing clutch plays in crucial moments, Han Solo is always ready to make a mark on the game.",
          "goals": 4,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Luke Skywalker",
          "position": "Forward",
          "bio": "Luke Skywalker, the dynamic forward, possesses a rare combination of skill, speed, and determination. With a natural talent for scoring goals, Luke electrifies the crowd with his acrobatic finishes and uncanny ability to find the back of the net. Beyond his impressive athleticism, Luke's unwavering commitment to his team and his unwavering belief in the power of teamwork inspire those around him. Whether soaring through the air for a header or dribbling past defenders with Jedi-like precision, Luke Skywalker is a force to be reckoned with on the soccer field.",
          "goals": 10,
          "assists": 9,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Admiral Ackbar",
          "position": "Forward",
          "bio": "Admiral Ackbar, known for his strategic brilliance and leadership, brings a tactical edge to the forward position. With a keen eye for openings and an innate sense of timing, Ackbar navigates the field with precision, orchestrating attacks and exploiting opponents' weaknesses. His ability to anticipate plays and make split-second decisions makes him a formidable presence in the attacking third. Ackbar's command on the field inspires confidence in his teammates and strikes fear into the hearts of his adversaries. With him leading the charge, victory is always within reach.",
          "goals": 5,
          "assists": 7,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/avengers.png",
      "name": "Avengers FC",
      "matches_played": 18,
      "wins": 5,
      "draws": 5,
      "losses": 8,
      "goals_for": 21,
      "goals_against": 26,
      "points": 20,
      "players": [
        {
          "name": "Captain America",
          "position": "Goalkeeper",
          "bio": "Captain America, known for his unwavering courage and unyielding determination, assumes the role of goalkeeper with honor and integrity. His indomitable spirit and keen sense of justice make him a stalwart defender of the goal, protecting it with unwavering resolve. Captain America's exceptional athleticism and keen strategic mind allow him to anticipate opponents' moves and react with lightning-fast reflexes. Whether diving to make a crucial save or commanding his defense with authority, Captain America embodies the ideals of teamwork, sacrifice, and heroism. With him guarding the goal, the team can trust in his unwavering dedication to defend their fortress.",
          "clean_sheets": 4,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Hulk",
          "position": "Defender",
          "bio": "The Hulk, renowned for his immense strength and unstoppable resilience, takes on the role of defender with unmatched power and ferocity. His towering presence on the field strikes fear into the hearts of opponents, as they face the formidable challenge of bypassing his formidable defense. With each thunderous tackle and bone-crushing block, the Hulk showcases his raw power and indomitable spirit, ensuring that no adversary can breach his defensive line easily. Despite his intimidating exterior, the Hulk possesses a heart of gold, fiercely loyal to his teammates and unwavering in his commitment to protect the goal at all costs. With the Hulk as their defender, the team can rest assured that their backline is fortified by the strongest guardian imaginable.",
          "goals": 2,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Thor",
          "position": "Defender",
          "bio": "Thor, the God of Thunder, brings his mighty presence to the field as a defender, wielding his enchanted hammer, Mjolnir, with unparalleled skill and strength. As a guardian of the goal, Thor combines his godly powers with tactical prowess, ensuring that no opponent can breach his defensive line. With lightning crackling in his wake, Thor commands the field with authority, inspiring his teammates to greatness and striking fear into the hearts of adversaries. His unwavering dedication to justice and honor drives him to defend the goal with unwavering resolve, making him an invaluable asset to any team. With Thor as their defender, the team can face any challenge with confidence, knowing that they have the power of a god protecting their goal.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 5,
          "red_cards": 0
        },
        {
          "name": "Black Widow",
          "position": "Midfielder",
          "bio": "Black Widow, the master spy and elite tactician, brings her unparalleled skills to the midfield, where her agility, intelligence, and strategic prowess shine brightest. Trained from a young age in the arts of combat and espionage, Black Widow navigates the field with grace and precision, outmaneuvering opponents and orchestrating plays with deadly efficiency. Her keen senses and quick reflexes make her a formidable presence in the midfield, capable of intercepting passes, creating scoring opportunities, and dictating the flow of the game. Behind her enigmatic facade lies a fierce determination and unyielding resolve, driving her to excel in every aspect of the game. With Black Widow on the midfield, the team gains a decisive advantage, as they harness the power of one of the world's most skilled and formidable athletes.",
          "goals": 2,
          "assists": 8,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Scarlet Witch",
          "position": "Midfielder",
          "bio": "Scarlet Witch, the master of chaos magic, commands the midfield with her mystical abilities and otherworldly talents. Born with incredible powers, Scarlet Witch possesses the unique ability to manipulate reality itself, bending the fabric of space and time to her will. As a midfielder, she channels her formidable magic to control the flow of the game, altering the course of events with a mere thought. With her telekinetic powers, she can effortlessly control the trajectory of the ball, sending it soaring past defenders and into the back of the net with uncanny precision. Scarlet Witch's presence on the field is both mesmerizing and unpredictable, as she weaves spells and incantations to confound her opponents and lead her team to victory. With her unwavering determination and indomitable spirit, Scarlet Witch stands as a force to be reckoned with, a true master of the midfield and a beacon of hope for her teammates.",
          "goals": 4,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Black Panther",
          "position": "Forward",
          "bio": "Black Panther, the sovereign of Wakanda, dominates the forward position with unmatched agility and combat skills. With his vibranium suit, he maneuvers swiftly, scoring goals with precision. A symbol of leadership and integrity, he inspires unity and excellence in his team, ready to lead them to victory.",
          "goals": 8,
          "assists": 4,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Vision",
          "position": "Forward",
          "bio": "Vision, the enigmatic android powered by the Mind Stone, brings unparalleled strength and agility to the forward position. Crafted from vibranium, his synthetic body grants remarkable speed and precision on the field. With the ability to phase through solid objects, Vision navigates defenses with ease, creating scoring opportunities for his team. His unwavering commitment to justice inspires teammates, driving them toward victory.",
          "goals": 5,
          "assists": 6,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/eyeofsauron.png",
      "name": "Mordor City",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 28,
      "goals_against": 22,
      "points": 27,
      "players": [
        {
          "name": "Mouth of Sauron",
          "position": "Goalkeeper",
          "bio": "Mouth of Sauron guards the goal with an ominous presence, embodying fear and intimidation. With his dark armor and sinister demeanor, he instills dread in opposing strikers. His keen reflexes and strategic mind make him a formidable last line of defense, deflecting shots with eerie precision. Though shrouded in mystery, his loyalty to Sauron's forces is unwavering, driving him to protect the net at any cost. As the gatekeeper of darkness, he stands resolute, ready to repel any threat to his team's goal.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Witch-King of Angmar",
          "position": "Defender",
          "bio": "The Witch-King of Angmar, a stalwart defender, commands the battlefield with an aura of dread and power. Clad in dark armor and wielding a formidable weapon, he strikes fear into the hearts of his adversaries. With unmatched strength and resilience, he stands firm against enemy attacks, thwarting their advances with calculated precision. As a servant of the Dark Lord, the Witch-King is bound by his oath to defend his realm at all costs, inspiring his teammates with his unwavering dedication. His mere presence on the field strikes terror into the opposition, making him a formidable force to be reckoned with.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lurtz",
          "position": "Defender",
          "bio": "Lurtz, a formidable defender, dominates the field with his imposing stature and ruthless efficiency. Born from the darkness of Isengard, he is a relentless warrior who strikes fear into the hearts of his foes. With his keen senses and unmatched combat skills, Lurtz stands as a bulwark against opposing offenses, using his strength and agility to thwart attacks and protect his team's goal. His loyalty to his master, Saruman, drives him to excel on the field, inspiring fear and respect in equal measure. As a defender, Lurtz embodies the relentless spirit of his orcish brethren, willing to sacrifice everything to secure victory for his team",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Balrog of Moria",
          "position": "Midfielder",
          "bio": "The Balrog of Moria, a fierce and formidable midfielder, commands the field with its immense power and fiery presence. Emerging from the depths of Khazad-dûm, this ancient demon wields flames and shadow to dominate the pitch. With each stride, the Balrog engulfs opponents in flames, leaving a trail of destruction in its wake. Its towering figure strikes fear into the hearts of adversaries, while its dark aura inspires awe and reverence among teammates. As a midfielder, the Balrog channels its infernal might to control the flow of play, unleashing devastating attacks and defending with unmatched ferocity. With a relentless pursuit of victory, the Balrog embodies the raw power and indomitable will of the forces of darkness, ready to crush any opposition that dares to challenge its supremacy on the field.",
          "goals": 3,
          "assists": 3,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Saruman",
          "position": "Midfielder",
          "bio": "Saruman, the cunning and enigmatic midfielder, commands the pitch with his strategic brilliance and mystical prowess. With a mind as sharp as Orthanc's spire, Saruman orchestrates plays with calculated precision, manipulating the flow of the game to his advantage. Gifted with knowledge of both arcane arts and tactical maneuvers, he weaves spells of confusion and deception, leaving opponents bewildered and vulnerable to his team's attacks. As a master of persuasion and diplomacy, Saruman inspires loyalty and cohesion among his teammates, forging them into a formidable force united under his leadership. With his gaze fixed on victory, Saruman seeks to bend the outcome of every match to his will, ensuring that his team emerges triumphant in their quest for glory.",
          "goals": 4,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "The Dark Lord Sauron",
          "position": "Forward",
          "bio": "The Dark Lord Sauron, a menacing force on the soccer pitch, dominates as a relentless forward with his overwhelming power and unmatched ambition. Towering over his opponents like the ominous shadow of Barad-dûr, Sauron instills fear with every stride, his fiery gaze piercing through defenses like a flaming arrow. With a relentless hunger for victory, he channels his dark energy into every play, driving his team forward with unyielding determination. Possessing unrivaled strength and agility, Sauron strikes fear into the hearts of defenders, unleashing thunderous shots that shake the very foundations of the field. As the embodiment of darkness and domination, he leads his team with an iron will, commanding them to conquer all who stand in their path. With each goal he scores, Sauron heralds the triumph of darkness, casting a shadow that looms over the soccer realm, forever altering the course of the game.",
          "goals": 10,
          "assists": 9,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Azog the Defiler",
          "position": "Forward",
          "bio": "Azog the Defiler dominates the forward position with his sheer strength and relentless drive, striking fear into defenders with each thunderous shot on goal. His towering presence and ruthless determination make him a formidable force on the soccer field, leaving opponents scrambling to contain his relentless attacks. With every goal he scores, Azog solidifies his reputation as a fearsome striker, driving his team forward with unmatched ferocity and determination.",
          "goals": 9,
          "assists": 12,
          "yellow_cards": 1,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/ring.png",
      "name": "Fellowship of the Ring",
      "matches_played": 18,
      "wins": 8,
      "draws": 2,
      "losses": 8,
      "goals_for": 27,
      "goals_against": 25,
      "points": 26,
      "players": [
        {
          "name": "Elrond",
          "position": "Goalkeeper",
          "bio": "Elrond, the wise and vigilant guardian of Rivendell, stands tall as the last line of defense in the goalkeeping position. With keen foresight and unwavering focus, he anticipates the movements of opposing strikers, ready to deflect any shot that comes his way. His calm demeanor and strategic prowess inspire confidence in his teammates, instilling a sense of security in the heart of the defense. As the protector of his realm and his team, Elrond brings honor and resilience to the soccer pitch, embodying the spirit of a true leader and guardian.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Boromir",
          "position": "Defender",
          "bio": "Boromir, the valiant defender of Gondor, brings strength and determination to the backline as he stands firm against opposing attackers. With his unyielding resolve and tactical insight, Boromir shields his teammates from danger, embodying the spirit of courage and loyalty on the soccer pitch. As a stalwart guardian of his realm and his comrades, Boromir's presence inspires unity and resilience, instilling hope in the face of adversity. With his unwavering commitment to defend his goal at all costs, Boromir proves himself to be a formidable force in the defense, ready to confront any challenge that comes his way.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gimli",
          "position": "Defender",
          "bio": "Gimli, the stout-hearted defender from the halls of Erebor, stands tall on the soccer pitch with his unmatched resilience and unwavering determination. With his axe in hand and his spirit unbroken, Gimli shields his teammates with unmatched loyalty and valor, embodying the indomitable spirit of the dwarves. As a fierce protector of his goal and his comrades, Gimli's presence inspires courage and camaraderie, rallying his team to stand firm against the fiercest adversaries. With his steadfast commitment to defend with honor and pride, Gimli proves himself to be an immovable force in the defense, ready to face any challenge with unyielding resolve.",
          "goals": 0,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gandalf",
          "position": "Midfielder",
          "bio": "Gandalf, the revered midfielder, commands the pitch with his unparalleled wisdom and mastery of the game. His presence inspires his teammates, instilling in them the courage and resilience needed to overcome any challenge. With a blend of astute strategy and magical prowess, Gandalf navigates the field with confidence, turning the tide of the game in his team's favor. As a mentor and leader, he imparts invaluable lessons, fostering unity and camaraderie among his comrades. With Gandalf leading the charge, victory is not merely a possibility but a certainty, as he leads his team to glory with unwavering resolve.",
          "goals": 2,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Frodo",
          "position": "Midfielder",
          "bio": "Frodo, the agile midfielder, maneuvers through the field with determination and grace. Despite his diminutive stature, Frodo possesses a heart as vast as the Shire and a spirit as resilient as Mithril. With each swift pass and strategic move, Frodo demonstrates his unwavering commitment to his team, proving that true strength lies not in physical prowess but in courage and resilience. Off the field, Frodo's humility and kindness make him a beloved teammate, fostering a sense of camaraderie and unity among the squad. With the ring of victory within reach, Frodo embarks on this epic journey with unwavering determination, ready to conquer any challenge that stands in his team's way.",
          "goals": 3,
          "assists": 12,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Aragorn",
          "position": "Forward",
          "bio": "Aragorn, the valiant forward, leads his team with unparalleled skill and determination. With each stride across the field, Aragorn embodies the spirit of a true warrior, channeling his royal lineage and years of battle experience into every shot on goal. Blessed with strength, agility, and a keen sense of strategy, Aragorn navigates through defenders with ease, leaving a trail of awe and admiration in his wake. Off the field, Aragorn's leadership and courage inspire his teammates to push beyond their limits, instilling in them the belief that victory is within their grasp. As the final whistle blows, Aragorn stands tall, ready to lead his team to glory and honor, both on the soccer pitch and in the annals of history.",
          "goals": 5,
          "assists": 7,
          "yellow_cards": 2,
          "red_cards": 1
        },
        {
          "name": "Legolas",
          "position": "Forward",
          "bio": "Legolas, the swift and agile forward, brings an elven grace to the soccer pitch. With his keen eyesight and unparalleled accuracy, Legolas strikes fear into the hearts of defenders as he effortlessly maneuvers through the opposition. His nimble footwork and lightning-fast reflexes allow him to weave past defenders with ease, leaving them in awe of his remarkable skill. Off the field, Legolas is a beacon of camaraderie and sportsmanship, inspiring his teammates to strive for greatness with his unwavering dedication and humility. As the game unfolds, Legolas stands ready to unleash his unrivaled talent, leading his team to victory with every goal he scores.",
          "goals": 16,
          "assists": 0,
          "yellow_cards": 3,
          "red_cards": 1
        }
      ]
    },
    {
      "icon": "team-icons/stark.png",
      "name": "Stark FC",
      "matches_played": 18,
      "wins": 6,
      "draws": 4,
      "losses": 8,
      "goals_for": 22,
      "goals_against": 23,
      "points": 22,
      "players": [
        {
          "name": "Ned Stark",
          "position": "Goalkeeper",
          "bio": "Ned Stark, the stalwart guardian of the goal, brings honor and resilience to the soccer field. With his unwavering dedication and tactical prowess, Ned stands as a formidable barrier against opposing strikers. His keen sense of leadership and commitment to his team inspire trust and confidence in his fellow players, instilling a sense of unity and determination on the field. As the last line of defense, Ned's bravery and selflessness shine through, earning him the respect of both teammates and rivals alike. With every save he makes, Ned upholds the values of integrity and duty, embodying the spirit of a true goalkeeper and leading his team to victory with unwavering resolve.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 1,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Rob Stark",
          "position": "Defender",
          "bio": "Robb Stark, the stalwart defender, commands the field with honor and courage. His unwavering loyalty and skillful tackles inspire trust among teammates, fostering unity and determination. With Robb at the helm, his team stands resilient, ready to face any challenge with strength and resolve.",
          "goals": 1,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Benjen Stark",
          "position": "Defender",
          "bio": "Benjen Stark, the vigilant defender, safeguards his team with unwavering dedication. His sharp instincts and swift interceptions thwart opponents' advances, ensuring the safety of his goal. As a stalwart protector, Benjen instills confidence in his fellow players, fortifying the team's defense with his resilience and commitment.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Bran Stark",
          "position": "Midfielder",
          "bio": "Bran Stark, the enigmatic midfielder, orchestrates plays with an otherworldly intuition. His strategic vision and precise passes unlock opportunities, shaping the team's rhythm and direction. Despite his enigmatic demeanor, Bran's presence on the field exudes a quiet confidence, inspiring his teammates to trust in his leadership and foresight.",
          "goals": 2,
          "assists": 4,
          "yellow_cards": 0,
          "red_cards": 0
        },
        {
          "name": "Rickon Stark",
          "position": "Midfielder",
          "bio": "Rickon Stark, the agile midfielder, brings youthful energy and determination to the game. With his swift footwork and fearless attitude, Rickon navigates through opponents, creating openings and disrupting defenses. Despite his tender age, Rickon's passion for the sport fuels his relentless pursuit of victory, making him a formidable force on the field.",
          "goals": 3,
          "assists": 4,
          "yellow_cards": 5,
          "red_cards": 0
        },
        {
          "name": "Catelyn Stark",
          "position": "Forward",
          "bio": "Catelyn Stark, the dynamic forward, possesses a keen sense of strategy and finesse on the soccer pitch. With her sharp instincts and decisive moves, Catelyn orchestrates plays and capitalizes on scoring opportunities with precision. Her leadership skills and determination inspire her teammates, driving them to push boundaries and excel. As a forward, Catelyn's relentless pursuit of goals and unwavering dedication to her team make her a formidable asset in any match.",
          "goals": 8,
          "assists": 4,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Arya Stark",
          "position": "Forward",
          "bio": "Arya Stark, the agile and tenacious forward, brings unparalleled speed and agility to the soccer field. With her swift footwork and cunning maneuvers, Arya swiftly navigates through opposing defenses, leaving them bewildered in her wake. Her relentless determination and fierce competitiveness make her a formidable opponent, as she fearlessly takes on challenges and strives for victory. Off the field, Arya's indomitable spirit and unwavering resolve inspire her teammates, driving them to push their limits and achieve greatness. As a forward, Arya's lightning-fast reflexes and sharp instincts make her a true force to be reckoned with, capable of turning the tide of any match in her team's favor.",
          "goals": 8,
          "assists": 3,
          "yellow_cards": 6,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/lannister.png",
      "name": "Lannister FC",
      "matches_played": 18,
      "wins": 6,
      "draws": 2,
      "losses": 10,
      "goals_for": 18,
      "goals_against": 27,
      "points": 20,
      "players": [
        {
          "name": "Tyrion Lannister",
          "position": "Goalkeeper",
          "bio": "Tyrion Lannister, the cunning and strategic goalkeeper, utilizes his intellect and quick thinking to defend the goal with precision and finesse. Despite his stature, Tyrion possesses remarkable agility and reflexes, enabling him to make acrobatic saves that defy expectations. Off the field, Tyrion's wit and charm make him a natural leader, capable of rallying his teammates and boosting morale in the face of adversity. As a goalkeeper, Tyrion's unorthodox methods and unconventional tactics keep opposing strikers guessing, making him a formidable presence between the goalposts. With his sharp mind and unwavering determination, Tyrion is always ready to rise to the challenge and protect his team's goal at all costs.",
          "clean_sheets": 5,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Jamie Lannister",
          "position": "Defender",
          "bio": "Jaime Lannister, the skilled and resolute defender, brings a combination of finesse and determination to the backline. Renowned for his swordsmanship and tactical prowess, Jaime applies the same level of precision and strategy to his defensive play on the soccer field. Despite his past reputation, Jaime has proven himself to be a reliable and steadfast teammate, always willing to sacrifice for the greater good of the team. Off the field, Jaime's leadership and charisma inspire those around him, fostering a sense of camaraderie and unity among his fellow players. With his unwavering commitment to excellence and his unwavering loyalty to his team, Jaime stands as a stalwart guardian of the defense, ready to thwart any opposing attacks and lead his team to victory.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 6,
          "red_cards": 2
        },
        {
          "name": "Tywin Lannister",
          "position": "Defender",
          "bio": "Tywin Lannister, the commanding presence in defense, brings a blend of intelligence and authority to the backline. Known for his strategic acumen and decisive leadership, Tywin orchestrates the defensive line with precision, ensuring that his teammates are organized and prepared for any challenge. Despite his stern demeanor, Tywin's dedication to excellence and his unwavering commitment to victory inspire respect and admiration from his fellow players. Off the field, Tywin's influence extends beyond the game, as he serves as a mentor and role model for younger players, instilling in them the values of discipline and teamwork. With his keen tactical mind and unyielding determination, Tywin stands as a formidable defender, ready to protect his team's goal and lead them to success.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Cersei Lannister",
          "position": "Midfielder",
          "bio": "Cersei Lannister, the midfield maestro, combines grace and cunning on the pitch. With her sharp intellect and calculated moves, Cersei orchestrates the flow of play from the center of the field, dictating the tempo and direction of the game. Her ability to anticipate opponents' actions and exploit their weaknesses makes her a formidable presence in midfield, capable of turning defense into swift counterattacks. Beyond her skill with the ball, Cersei's fierce determination and unwavering ambition drive her to push boundaries and seize every opportunity for victory. Off the field, Cersei's commanding presence and keen insight make her a natural leader, inspiring her teammates to strive for greatness. With her strategic vision and indomitable spirit, Cersei stands ready to lead her team to glory on the soccer pitch.",
          "goals": 3, 
          "assists": 3,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Joffrey Baratheon",
          "position": "Midfielder",
          "bio": "Joffrey Baratheon, the midfielder with a regal air, brings a mix of arrogance and flair to the pitch. Blessed with natural talent and a royal upbringing, Joffrey's skill on the ball is matched only by his confidence. With his quick feet and sharp instincts, he navigates the midfield with ease, often leaving opponents trailing in his wake. However, Joffrey's penchant for showboating and his volatile temper can sometimes overshadow his undeniable talent, making him a divisive figure on and off the field. Despite his flaws, Joffrey's hunger for success and his desire to prove himself as the best drive him to push his limits and strive for greatness. As he takes to the pitch, Joffrey's eyes are set on glory, determined to leave his mark on the game and claim his rightful place among soccer's elite.",
          "goals": 2,
          "assists": 9,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Tommen Baratheon",
          "position": "Forward",
          "bio": "Tommen Baratheon, the forward with a gentle demeanor, brings a sense of innocence and purity to the field. Despite his young age, Tommen possesses a natural talent for scoring goals, fueled by his unwavering dedication and love for the game. With his quick reflexes and sharp instincts, he navigates the opposition's defense with ease, often finding himself in the right place at the right time to capitalize on scoring opportunities. Off the field, Tommen's humility and kindness make him a beloved figure among fans and teammates alike, earning him respect both on and off the pitch. As he steps onto the field, Tommen's eyes light up with excitement, ready to showcase his skills and make his mark on the game, all while staying true to his values and principles.",
          "goals": 6,
          "assists": 3,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lancel Lannister",
          "position": "Forward",
          "bio": "Lancel Lannister, the forward known for his agility and determination, brings a fierce competitiveness to the pitch. Despite his slender frame, Lancel possesses remarkable speed and precision, making him a formidable opponent for any defense. With a keen eye for goal and a knack for finding openings in the defense, he's often the catalyst for his team's attacking plays. Off the field, Lancel is known for his dedication to training and his unwavering commitment to his team, earning him admiration from fans and teammates alike. As he takes to the field, Lancel's focus is unwavering, driven by his desire to succeed and lead his team to victory.",
          "goals": 6,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 1
        }
      ]
    },
    {
      "icon": "team-icons/gryffindor.png",
      "name": "Gryffindor Rovers",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 19,
      "goals_against": 20,
      "points": 27,
      "players": [
        {
          "name": "Minerva McGonagall",
          "position": "Goalkeeper",
          "bio": "Minerva McGonagall, the stoic goalkeeper renowned for her exceptional reflexes and unwavering determination, stands as a formidable guardian of the goalposts. With her keen intellect and strategic prowess, she anticipates opposing strikers' moves with precision, thwarting their attempts to score. McGonagall's commanding presence instills confidence in her teammates, inspiring them to perform at their best. Off the field, she is a respected leader, known for her unwavering commitment to excellence and fairness. As she steps onto the pitch, McGonagall's steely resolve and unwavering dedication make her a force to be reckoned with, ready to defend her team's goal with unmatched skill and determination.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Ginny Weasley",
          "position": "Defender",
          "bio": "Ginny Weasley, the fearless defender known for her tenacity and agility, stands as a stalwart guardian of the team's defensive line. With her quick reflexes and strategic mind, she anticipates opposing attackers' moves, intercepting passes and thwarting goal-scoring opportunities. Weasley's determination and leadership inspire confidence in her teammates, rallying them to give their all on the field. Off the pitch, she is admired for her unwavering loyalty and courage, making her a respected figure both on and off the field. As she takes her position on the pitch, Weasley's unwavering resolve and defensive prowess make her a formidable opponent, ready to protect her team's goal with unwavering determination.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Ron Weasley",
          "position": "Defender",
          "bio": "Ron Weasley, a dependable defender, brings a blend of resilience and determination to the team's defensive lineup. With his keen awareness and tactical prowess, he excels at thwarting opposing attackers and breaking up plays. Weasley's unwavering commitment and loyalty make him a reliable presence on the field, always ready to give his all for the team. Beyond the pitch, his friendly demeanor and unwavering support for his teammates make him a beloved figure in the squad. As he takes his position on the field, Weasley's defensive skill and steadfast resolve make him an invaluable asset, ready to protect the team's goal with unwavering determination.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "Fred Weasley",
          "position": "Midfielder",
          "bio": "Fred Weasley, a dynamic midfielder, injects creativity and flair into the team's midfield with his quick wit and clever footwork. Known for his unpredictable playing style and knack for pulling off unexpected maneuvers, Fred keeps opponents guessing and teammates inspired. His infectious energy and playful spirit bring a sense of camaraderie to the squad, fostering a positive atmosphere both on and off the pitch. With his ability to turn the tide of a match with a well-timed pass or a daring shot on goal, Fred adds a crucial dimension to the team's attacking prowess. As he orchestrates plays from the midfield, Fred Weasley's presence is felt across the field, driving the team forward towards victory.",
          "goals": 2,
          "assists": 3,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "George Weasley",
          "position": "Midfielder",
          "bio": "George Weasley, a versatile midfielder, complements his team's playing style with his astute vision and precise passing. His innate understanding of the game allows him to anticipate plays and distribute the ball effectively, dictating the tempo of the match from the midfield. With his creative playmaking abilities and sharp instincts, George often serves as the linchpin of his team's offensive maneuvers, linking up with teammates and orchestrating attacks with finesse. Beyond his on-field contributions, George's unwavering determination and resilient spirit inspire his fellow players, driving them to push their limits and strive for success. Whether it's breaking up opposition plays or engineering scoring opportunities, George Weasley consistently demonstrates his commitment to the team's collective objectives, earning the admiration of fans and teammates alike.",
          "goals": 3,
          "assists": 3,
          "yellow_cards": 6,
          "red_cards": 0
        },
        {
          "name": "Harry Potter",
          "position": "Forward",
          "bio": "Harry Potter, the lightning-fast forward, electrifies the pitch with his remarkable speed and agility. As the focal point of his team's attack, Harry uses his exceptional athleticism and quick footwork to outmaneuver defenders and create scoring opportunities. With a natural instinct for goal-scoring, he possesses a keen eye for goal and the composure to finish with precision under pressure. Harry's ability to change the course of a match with his dynamic play and decisive finishing makes him a constant threat to opposing defenses. Off the field, his leadership qualities and unwavering determination inspire his teammates, fostering a strong sense of camaraderie and unity within the squad. With his boundless talent and indomitable spirit, Harry Potter embodies the essence of a true footballing wizard, captivating fans and leaving a lasting legacy on the game.",
          "goals": 5,
          "assists": 4,
          "yellow_cards": 8,
          "red_cards": 2
        },
        {
          "name": "Hermione Granger",
          "position": "Forward",
          "bio": "Hermione Granger, the forward with an exceptional intellect, brings a unique blend of skill and strategy to the pitch. Renowned for her tactical prowess and quick thinking, Hermione is a master at reading the game and exploiting opponent weaknesses. Her precise passing and deft ball control make her a formidable playmaker, capable of unlocking even the tightest defenses with her insightful through balls and clever movement off the ball. Hermione's relentless work ethic and determination to succeed drive her to constantly improve and push the boundaries of her abilities. Off the field, her leadership qualities and dedication to teamwork inspire her teammates to strive for excellence and work together towards achieving their goals. With her combination of intelligence, skill, and passion for the game, Hermione Granger proves that true greatness knows no bounds on the football pitch.",
          "goals": 8,
          "assists": 8,
          "yellow_cards": 3,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/slytherin.png",
      "name": "Slytherin Albion",
      "matches_played": 18,
      "wins": 6,
      "draws": 4,
      "losses": 8,
      "goals_for": 15,
      "goals_against": 28,
      "points": 22,
      "players": [
        {
          "name": "Vincent Crabbe",
          "position": "Goalkeeper",
          "bio": "Vincent Crabbe, the imposing figure guarding the goal, is a formidable presence between the posts. With his towering stature and lightning-fast reflexes, Crabbe instills fear in opposition strikers, making it difficult for them to find the back of the net. His commanding presence in the penalty area and ability to anticipate shots make him a reliable last line of defense for his team. Despite his intimidating demeanor on the field, Crabbe is known for his unwavering loyalty to his teammates and his willingness to put his body on the line to keep the opposition at bay. Off the pitch, he is a quiet and reserved individual who leads by example, always putting the team's success above personal glory. With his impressive shot-stopping abilities and commitment to his team, Vincent Crabbe is a vital asset for any squad looking to secure victory on the football pitch.",
          "clean_sheets": 3,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Severus Snape",
          "position": "Defender",
          "bio": "Severus Snape, the enigmatic defender, brings a unique blend of skill and strategy to the backline. With his keen intellect and sharp instincts, Snape anticipates opposition movements with precision, thwarting attacking plays before they even materialize. His mastery of defensive tactics and ability to read the game allow him to neutralize even the most potent offensive threats with ease. Despite his stern demeanor on the field, Snape is a fiercely loyal teammate who always puts the needs of the team above his own. Off the pitch, he is known for his dedication to the sport and his unwavering commitment to excellence, inspiring those around him to strive for greatness. With Severus Snape anchoring the defense, his team can rest assured knowing that their goal is well-protected and victory is within reach.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lucius Malfoy",
          "position": "Defender",
          "bio": "Lucius Malfoy, the sleek defender, blends elegance with ruthlessness on the field. With aristocratic poise, he controls the backline, ensuring security and organization. His strategic mind and impeccable footwork outmaneuver attackers with finesse. Despite controversy, his commitment to victory remains unwavering. With Malfoy guarding the defense, his team faces challenges confidently.",
          "goals": 0,
          "assists": 2,
          "yellow_cards": 4,
          "red_cards": 0
        },
        {
          "name": "Bellatrix Lestrange",
          "position": "Midfielder",
          "bio": "Bellatrix Lestrange, a fierce midfielder, embodies chaos and unpredictability on the pitch. Her cunning and aggression disrupt opponents' strategies, creating opportunities for her team. With her unyielding determination and dark prowess, she dominates the midfield, instilling fear in her adversaries. Despite her menacing demeanor, her loyalty to her team is unwavering. With Lestrange on the field, victory is within reach, no matter the odds.",
          "goals": 2,
          "assists": 1,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Lord Voldemort",
          "position": "Midfielder",
          "bio": "Lord Voldemort, a formidable midfielder, commands the field with his dark powers and strategic brilliance. His unmatched agility and cunning make him a relentless force to be reckoned with. With a singular focus on victory, Voldemort spares no effort in leading his team to triumph. Despite his sinister reputation, his dedication to the sport is undeniable, driving him to excel on the pitch. With Voldemort as their midfield maestro, his team strikes fear into the hearts of opponents, ensuring dominance with every match.",
          "goals": 3,
          "assists": 6,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Draco Malfoy",
          "position": "Forward",
          "bio": "Draco Malfoy, a dynamic forward, brings a blend of skill and determination to the pitch. With swift footwork and precise strikes, he poses a constant threat to opposing defenses. Draco's strategic mindset and competitive spirit drive him to push beyond his limits in pursuit of victory. Despite his reputation, Draco's commitment to his team and the sport shines through in every match. As he takes to the field, Draco Malfoy is poised to leave his mark as a formidable force in the world of soccer.",
          "goals": 4,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gregory Goyle",
          "position": "Forward",
          "bio": "Gregory Goyle, a powerful forward, showcases his strength and tenacity on the soccer field. With a robust physique and imposing presence, he excels in physical battles against defenders. Goyle's determination and unwavering focus make him a reliable asset in both scoring goals and creating opportunities for his team. Despite his intimidating demeanor, Goyle's passion for the game drives him to overcome challenges and contribute to his team's success. As he charges forward with determination, Gregory Goyle proves to be a formidable force in the world of soccer.",
          "goals": 5,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        }
      ]
    },
    {
      "icon": "team-icons/hydra.png",
      "name": "MCU Villains",
      "matches_played": 18,
      "wins": 8,
      "draws": 3,
      "losses": 7,
      "goals_for": 20,
      "goals_against": 15,
      "points": 27,
      "players": [
        {
          "name": "Loki",
          "position": "Goalkeeper",
          "bio": "Loki, the cunning goalkeeper, brings his deceptive tactics and quick reflexes to the soccer pitch. Known for his shrewdness and unpredictability, Loki keeps opponents guessing with his strategic maneuvers and ability to outwit even the most skilled strikers. With his mastery of illusions and trickery, he creates an aura of uncertainty that unnerves opposing teams, making him a formidable obstacle in front of the goal. Despite his mischievous nature, Loki's loyalty to his team drives him to protect the net with unwavering determination. As he guards the goal with finesse and flair, Loki proves to be an invaluable asset to his team's defense.",
          "clean_sheets": 2,
          "goals": 0,
          "assists": 0,
          "yellow_cards": 1,
          "red_cards": 0
        },
        {
          "name": "Killmonger",
          "position": "Defender",
          "bio": "Killmonger, the tenacious defender, brings a relentless intensity and fierce determination to the soccer field. Raised in hardship and driven by a thirst for justice, Killmonger embodies resilience and strength in every tackle and interception. With his exceptional athleticism and combat skills, he dominates the defensive line, thwarting opponents' advances with unwavering resolve. Killmonger's unwavering commitment to his teammates and his unyielding spirit make him a formidable presence on the pitch, inspiring those around him to strive for greatness. As he defends with passion and purpose, Killmonger proves to be an indispensable pillar of his team's defense, ready to overcome any challenge that comes his way.",
          "goals": 1,
          "assists": 0,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Gorr the God Butcher",
          "position": "Defender",
          "bio": "Gorr the God Butcher, a formidable defender, brings unparalleled strength and ferocity to the soccer field. With his relentless determination and unwavering focus, Gorr dominates the defensive line, thwarting opponents' attacks with unmatched skill and precision. Born from tragedy and driven by a thirst for vengeance, Gorr embodies resilience and tenacity in every challenge he faces. His imposing presence and indomitable spirit inspire fear in his adversaries and courage in his teammates. With Gorr on the field, his team can always count on his unwavering commitment and unmatched prowess to defend their goal with unmatched determination.",
          "goals": 0,
          "assists": 1,
          "yellow_cards": 3,
          "red_cards": 0
        },
        {
          "name": "Thanos",
          "position": "Midfielder",
          "bio": "Thanos, the mighty midfielder, commands the pitch with unparalleled strength and strategic prowess. Endowed with formidable power and intellect, Thanos dominates the midfield, orchestrating plays with precision and ruthlessness. Driven by a vision of cosmic balance, Thanos possesses an unwavering determination to achieve his goals, both on and off the field. With his indomitable will and unmatched skill, Thanos inspires fear in his opponents and admiration in his teammates. His presence on the pitch instills a sense of inevitability, as he maneuvers through challenges with calculated efficiency. As a master tactician and relentless competitor, Thanos is poised to lead his team to victory, no matter the cost.",
          "goals": 3,
          "assists": 2,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "Ultron",
          "position": "Midfielder",
          "bio": "Ultron, the midfield marvel, brings a fusion of advanced technology and unparalleled agility to the pitch. Created with a singular purpose to evolve and conquer, Ultron commands the midfield with ruthless efficiency and unmatched intellect. With lightning-fast reflexes and precision accuracy, Ultron maneuvers through opponents with ease, leaving a trail of destruction in his wake. As an artificial intelligence with a relentless drive for perfection, Ultron adapts to any situation, analyzing the field and orchestrating plays with machine-like precision. Despite his cold and calculating nature, Ultron's presence on the pitch is undeniable, as he leads his team with unwavering determination towards victory.",
          "goals": 2,
          "assists": 8,
          "yellow_cards": 3,
          "red_cards": 1
        },
        {
          "name": "Hela",
          "position": "Forward",
          "bio": "Hela, the fierce and formidable forward, commands the pitch with her otherworldly strength and deadly prowess. As the Goddess of Death, Hela strikes fear into the hearts of defenders with her relentless attacks and unstoppable determination. With each stride, she exudes an aura of power and dominance, overpowering her opponents with ease. With her lethal combination of speed, agility, and precision, Hela maneuvers past defenders with grace and finesse, leaving a trail of destruction in her wake. As she unleashes her wrath upon the field, Hela proves to be an unstoppable force, leading her team towards victory with unmatched ferocity and determination.",
          "goals": 6,
          "assists": 4,
          "yellow_cards": 2,
          "red_cards": 0
        },
        {
          "name": "The Winter Soldier",
          "position": "Forward",
          "bio": "The Winter Soldier, a formidable forward on the field, embodies the essence of precision and power. With a mysterious past shrouded in shadows, he brings an air of intrigue and danger to the game. As a master of combat and strategy, The Winter Soldier maneuvers through defenses with calculated precision, striking fear into the hearts of his opponents. His relentless pursuit of victory is fueled by a sense of duty and purpose, driving him to push beyond his limits to secure success for his team. With each goal he scores, The Winter Soldier cements his legacy as a force to be reckoned with on the soccer pitch, leaving an indelible mark on the game and inspiring awe in all who witness his prowess.",
          "goals": 8,
          "assists": 5,
          "yellow_cards": 6,
          "red_cards": 0
        }
      ]
    }
  ]
}